var a = 1, b = 1, c, d;
c = ++a; alert(c); // 2: Потому что сначала выполняется увеличение "a" на 1, затем "с" присваивается значение увеличенной на 1 переменной a
d = b++; alert(d); // 1:  сначала "d" присваивается значение "b", затем "b" увеличивается на 1
c = (2+ ++a); alert(c); // 5: к 2 прибавляется увеличенное на 1 значение "a", а "a"=2, в итоге 2+3=5 
d = (2+ b++); alert(d); // 4: 2+2=4, затем b увеличивается на 1
alert(a); // 3: в результате всех манипуляций a=3
alert(b); // 3 в результате всех манипуляций b=3
